# Data clenaing

#### you can find the reference [here](https://realpython.com/python-data-cleaning-numpy-pandas/)

#### We’ll cover the following:

- Dropping unnecessary columns in a DataFrame
- Changing the index of a DataFrame
- Using .str() methods to clean columns
- Using the DataFrame.applymap() function to clean the entire dataset, element-wise
- Renaming columns to a more recognizable set of labels
- Skipping unnecessary rows in a CSV file

#### Here are the datasets that we will be using:

- [BL-Flickr-Images-Book.csv](https://github.com/realpython/python-data-cleaning/blob/master/Datasets/BL-Flickr-Images-Book.csv) – A CSV file containing information about books from the British Library
- [university_towns.txt](https://github.com/realpython/python-data-cleaning/blob/master/Datasets/university_towns.txt) – A text file containing names of college towns in every US state
- [olympics.csv](https://github.com/realpython/python-data-cleaning/blob/master/Datasets/olympics.csv) – A CSV file summarizing the participation of all countries in the Summer and Winter Olympics

In [1]:
#we just need 2 libraries 
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('BL-Flickr-Images-Book.csv')
df.head()

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

here we can see NAN(Not A Number) values in some columns like **Edition statement, Corporate Author,Corporate Contributors, former owner,Engraver, Issuance type and Shelfmarks**.

In [3]:
#dropping them
to_drop = ['Edition Statement','Corporate Author','Corporate Contributors','Former owner','Engraver','Contributors','Issuance type','Shelfmarks']
df.drop(to_drop, inplace  = True, axis = 1)
#you can even use this code i.e more intuitive
#df.drop(columns = to_drop, inplace  =True)

In [4]:
df.head()

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

## Changing the Index of a DataFrame

lets change the index of dataframe called **Identifier**. This helps when a librarian search books using Identifier as it is **unique**.

In [5]:
df['Identifier'].is_unique

True

This shows that the dataframe **Identifier is Unique.**

In [6]:
df = df.set_index('Identifier')

In [7]:
df.head()

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

we can access a row (or) data point using **df.loc[value]**

In [8]:
#To access row
df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 206, dtype: object

In [10]:
#to access column
df.iloc[:,0]

Identifier
206                                                   London
216                                 London; Virtue & Yorston
218                                                   London
472                                                   London
480                                                   London
481                                                   London
519                                                   London
667                      pp. 40. G. Bryan & Co: Oxford, 1898
874                                                  London]
1143                                                  London
1280                                                Coventry
1808                                             Christiania
1905                                                 Firenze
1929                                               Amsterdam
2836                                                  Savona
2854                                                  London
2956                                                   Paris
2957                                                   Paris
3017                                             Puerto-Rico
3131                                                New York
4598                                                    Hull
4884                                                  London
4976                                                  Oxonii
5382                                                  London
5385                                                  London
5389                                                  London
5432                                                  Milano
6036                                                  London
6821                                                Aberdeen
7521                                                    Wien
                                 ...
4053464                      London: E. Nutt; E. Cooke, 1733
4063671                                               London
4072044                  London: D. Wilson & T. Durham, 1752
4077038          London: printed for Nicholas Vavasour, 1634
4079258                                              Glasgow
4079262                                               London
4112297           London: Macmillan & Co., pp. xl, 400. 1895
4112525                                             Pontoise
4112839                                               London
4113012                                         Philadelphia
4113816    pp. xxvi, 375. London: Jackson, Walford & Hodd...
4114334               pp. viii. 64. J. Debrett: London, 1789
4114390                                               London
4114889                                               London
4114986                                               London
4115138                                 G. Eld: London, 1608
4116063                                               London
4117526                                              Leipzig
4117583                                               London
4117749                                             New York
4117751                                             New York
4117752                                               London
4156359                                             New York
4157746                                               London
4157862                                  Newcastle-upon-Tyne
4158088                                               London
4158128                                                Derby
4159563                                               London
4159587                                  Newcastle upon Tyne
4160339                                               London
Name: Place of Publication, Length: 8287, dtype: object

## Tidying up Fields in the Data

 In this section, we will clean specific columns and get them to a uniform format to get a better understanding of the dataset and enforce consistency. In particular, we will be cleaning Date of Publication and Place of Publication.

Upon inspection, all of the data types are currently the object dtype, which is roughly analogous to str in native Python.

In [12]:
df.get_dtype_counts()

object    6
dtype: int64

One field where it makes sense to enforce a numeric value is the date of publication so that we can do calculations down the road:

In [16]:
df.loc[1905:,'Date of Publication'].head(10)
#this gets you all the rows after the identifier value 1905 and Date of Publication column

Identifier
1905           1888
1929    1839, 38-54
2836           1897
2854           1865
2956        1860-63
2957           1873
3017           1866
3131           1899
4598           1814
4884           1820
Name: Date of Publication, dtype: object

A particular book can have only one date of publication. Therefore, we need to do the following:

- Remove the extra dates in square brackets, wherever present: 1879 [1878]
-  Convert date ranges to their “start date”, wherever present: 1860-63; 1839, 38-54
- Completely remove the dates we are not certain about and replace them with NumPy’s NaN: [1897?]
- Convert the string nan to NumPy’s NaN value

In [17]:
# we can use regular expressions to extract publication year
regex =  r'^(\d{4})'
#r for rawstring
#\d represents any digit
#{4} repeats this rule 4 times
#^ represents start of string

In [18]:
extract = df['Date of Publication'].str.extract(r'^(\d{4})', expand = False)

In [19]:
extract.head()

Identifier
206    1879
216    1868
218    1869
472    1851
480    1857
Name: Date of Publication, dtype: object

Technically, this column still has object dtype, but we can easily get its numerical version with pd.to_numeric:

In [20]:
df['Date of Publication'] = pd.to_numeric(extract)
df['Date of Publication'].dtype

dtype('float64')

In [21]:
#this shows missing values
df['Date of Publication'].isna().sum()

971

In [22]:
#this shows count of values exist
df['Date of Publication'].count()

7316

In [25]:
#this shows the total number exist
len(df)

8287

In [26]:
#shows the % of missing values
df['Date of Publication'].isnull().sum()/len(df)*100

11.717147339205985

numpy where function
>>> np.where(condition, then, else)

In [28]:
#lets see some specific columns of Place of publication
df.loc[4157862]

Place of Publication                                  Newcastle-upon-Tyne
Date of Publication                                                  1867
Publisher                                                      T. Fordyce
Title                   Local Records; or, Historical Register of rema...
Author                      FORDYCE, T. - Printer, of Newcastle-upon-Tyne
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 4157862, dtype: object

In [29]:
df.loc[4159587]

Place of Publication                                  Newcastle upon Tyne
Date of Publication                                                  1834
Publisher                                                Mackenzie & Dent
Title                   An historical, topographical and descriptive v...
Author                                              Mackenzie, E. (Eneas)
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 4159587, dtype: object

These two books were published in the same place, but one has hyphens in the name of the place while the other does not.

To clean this column in one sweep, we can use str.contains() to get a boolean mask.

We clean the column as follows:

In [30]:
pub = df['Place of Publication']
london = pub.str.contains('London')
london[:5]

Identifier
206    True
216    True
218    True
472    True
480    True
Name: Place of Publication, dtype: bool

In [31]:
oxford = pub.str.contains('Oxford')

We combine them with np.where:

 np.where(condition1, x1, 
        np.where(condition2, x2, 
            np.where(condition3, x3, ...)))

In [32]:
df['Place of Publication']  = np.where(london,'London',
                                      np.where(oxford,'Oxford',
                                              pub.str.replace('-','')))
df['Place of Publication'].head()

Identifier
206    London
216    London
218    London
472    London
480    London
Name: Place of Publication, dtype: object